In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("usersv2.csv")

In [3]:
data.head()

,name,age,username,email,country,postcode,gender
0,Ms Fátima Martin,42,goldenmouse797,fatima.martin@example.com,Spain,43746,female
1,Mrs Molly Garrett,30,smallpanda982,molly.garrett@example.com,Ireland,57660,female
2,Ms Veena Kulkarni,53,smalltiger174,veena.kulkarni@example.com,India,29797,female
3,Miss Sheryl Cole,74,beautifulcat191,sheryl.cole@example.com,United Kingdom,TH3 7XG,female
4,Ms Nataša Subašić,55,bigbird256,natasa.subasic@example.com,Serbia,83260,female

Obtener el nombre y correo de todos los usuarios.

In [4]:
data[["name", "email"]]

                       name                           email
0          Ms Fátima Martin       fatima.martin@example.com
1         Mrs Molly Garrett       molly.garrett@example.com
2         Ms Veena Kulkarni      veena.kulkarni@example.com
3          Miss Sheryl Cole         sheryl.cole@example.com
4         Ms Nataša Subašić      natasa.subasic@example.com
...                     ...                             ...
1995  Ms Viktoria Lauritsen  viktoria.lauritsen@example.com
1996   Mr Christian Sørhaug   christian.sorhaug@example.com
1997       Ms Maria Peković       maria.pekovic@example.com
1998      Mrs Nicole Jensen       nicole.jensen@example.com
1999  Mr Percy Blankenstein  percy.blankenstein@example.com

[2000 rows x 2 columns]

Obtener el nombre de todos los usuarios cuyo sexo es Femenino.

In [5]:
data.name[data.gender == "female"]

0            Ms Fátima Martin
1           Mrs Molly Garrett
2           Ms Veena Kulkarni
3            Miss Sheryl Cole
4           Ms Nataša Subašić
                ...
1992        Ms Floriana Ramos
1994             Ms Bella Lee
1995    Ms Viktoria Lauritsen
1997         Ms Maria Peković
1998        Mrs Nicole Jensen
Name: name, Length: 1013, dtype: object

Obtener el nombre de todos los usuarios cuyo sexo es Masculino y tengan una edad mayor a 50.

In [6]:
data.name[(data.gender == "male") & (data.age > 50)]

6                   Mr Oscar Olsen
10      Monsieur Francesco Leclerc
12                 Mr Sean Shelton
17                Mr Lennox Økland
19                   Mr Jose Wells
                   ...
1980               Mr Sierd Donker
1983          Mr Alfred Williamson
1987                Mr Blake Slawa
1991                 Mr Jake Moore
1993            Mr Zachary Stevens
Name: name, Length: 461, dtype: object

Obtener todos los usuarios cuya edad sea mayor a 20.

In [7]:
data.name[data.age > 20]

0            Ms Fátima Martin
1           Mrs Molly Garrett
2           Ms Veena Kulkarni
3            Miss Sheryl Cole
4           Ms Nataša Subašić
                ...
1995    Ms Viktoria Lauritsen
1996     Mr Christian Sørhaug
1997         Ms Maria Peković
1998        Mrs Nicole Jensen
1999    Mr Percy Blankenstein
Name: name, Length: 2000, dtype: object

Obtener el username y correo electrónico de los usuarios cuya edad se encuentre
en el rango 10 a 20.

In [8]:
condition = (data.age > 10) & (data.age < 20)
data[["username", "email"]][condition]

Empty DataFrame
Columns: [username, email]
Index: []

In [9]:
data[["username", "email"]][data.age.between(10,20)]

Empty DataFrame
Columns: [username, email]
Index: []

Obtener el username de todos los usuarios cuyo correo no terminen con
@example.com

In [10]:
data.username[~data.email.str.endswith("@example.com")]

Series([], Name: username, dtype: object)

Obtener el username de todos los usuarios cuyo país sea Alemania, Finlandia o
Canadá.

In [11]:
countries = ["Alemania", "Filandia", "Canada"]
data.username[data.country.isin(countries)]

15          smalltiger986
18            whitecat263
29      brownbutterfly120
40      organicleopard484
72          greentiger739
              ...
1909         tinygoose508
1910         crazybird424
1922         bluesnake283
1934         whitebear676
1987      whiteostrich177
Name: username, Length: 105, dtype: object

Obtener el nombre y correo electronico de todos los usuarios de sexo Femenino
que sean del país Alemania.

In [12]:
condition = (data.gender == "female") & (data.country == "Alemania")
data[["name", "email"]][condition]

Empty DataFrame
Columns: [name, email]
Index: []

Obtener el promedio de edad de todos los usuarios de sexo Femenido de Canada
mayores de 20 años.

In [13]:
condition = (data.gender == "female") & (data.country == "Canada") & (data.age > 20)
data.age[condition].mean()

53.89090909090909

Conocer la cantidad de usuarios que residen en Finlandia.

In [14]:
data[data.country == "Filandia"].count()

name        0
age         0
username    0
email       0
country     0
postcode    0
gender      0
dtype: int64

Mostrar en consola la cantidad de hombre y mujeres en el dataframe.

In [15]:
data.groupby(["gender"]).count()

        name   age  username  email  country  postcode
gender
female  1013  1013      1013   1013     1013      1013
male     987   987       987    987      987       987

Mostrar en consola el país con más mujeres

In [16]:
data[data.gender == "female"].groupby(["country"]).count()["gender"].sort_values(ascending=False)

country
France            61
Canada            55
Spain             53
Australia         52
Brazil            52
Denmark           51
United Kingdom    50
New Zealand       50
Mexico            50
Netherlands       49
India             49
Switzerland       49
Germany           48
Ireland           47
Finland           47
Turkey            45
United States     45
Norway            44
Serbia            42
Ukraine           41
Iran              33
Name: gender, dtype: int64

Obtener los 3 países con más usuarios.

In [17]:
data.groupby(["country"])["name"].count().sort_values(ascending=False)

country
Australia         112
Germany           108
Spain             106
Canada            105
Finland           103
United Kingdom    102
Netherlands       101
France            100
Denmark            98
India              98
Ireland            97
United States      94
Brazil             93
Switzerland        91
Ukraine            90
New Zealand        89
Turkey             88
Norway             86
Serbia             86
Mexico             83
Iran               70
Name: name, dtype: int64

Mostrar en consola el nombre de todos los usuarios cuya edad se encuentre en el
rango de 10 a 20 y 40 a 70.

In [77]:
condition = (data.age.between(10, 20)) | (data.age.between(40,70))
data[["name", "age"]][condition]

                    name  age
0       Ms Fátima Martin   42
2      Ms Veena Kulkarni   53
4      Ms Nataša Subašić   55
6         Mr Oscar Olsen   60
7        Ms Marta Selvik   63
...                  ...  ...
1989  Miss Sylvana Stoll   67
1990    Mr Marius Møller   50
1991       Mr Jake Moore   61
1993  Mr Zachary Stevens   70
1997    Ms Maria Peković   45

[1119 rows x 2 columns]

Mostrar en consola todos los usuarios con correo electrónico.

In [19]:
data[data.email.notnull()]

,name,age,username,email,country,postcode,gender
0,Ms Fátima Martin,42,goldenmouse797,fatima.martin@example.com,Spain,43746,female
1,Mrs Molly Garrett,30,smallpanda982,molly.garrett@example.com,Ireland,57660,female
2,Ms Veena Kulkarni,53,smalltiger174,veena.kulkarni@example.com,India,29797,female
3,Miss Sheryl Cole,74,beautifulcat191,sheryl.cole@example.com,United Kingdom,TH3 7XG,female
4,Ms Nataša Subašić,55,bigbird256,natasa.subasic@example.com,Serbia,83260,female
...,...,...,...,...,...,...,...
1995,Ms Viktoria Lauritsen,38,heavyzebra441,viktoria.lauritsen@example.com,Norway,1545,female
1996,Mr Christian Sørhaug,28,goldensnake897,christian.sorhaug@example.com,Norway,3614,male
1997,Ms Maria Peković,45,redzebra951,maria.pekovic@example.com,Serbia,30159,female
1998,Mrs Nicole Jensen,78,beautifuldog292,nicole.jensen@example.com,United Kingdom,L9J 1QE,female
1999,Mr Percy Blankenstein,36,ticklishostrich632,percy.blankenstein@example.com,Netherlands,3143 RR,male

In [21]:
data.email.isnull().any()

False

Mostrar en pantalla el nombre y correo electrónico del usuario más joven en Canadá.

In [38]:
data[['name', 'email', 'age']][(data.country == 'Canada')].sort_values('age').head(1)

                 name                      email  age
262  Mr Dylan Ouellet  dylan.ouellet@example.com   21

Mostrar en pantalla el nombre y correo electrónico del usuario más viejo en Canada.

In [39]:
data[['name', 'email', 'age']][(data.country == 'Canada')].sort_values('age', ascending=False).head(1)

                   name                       email  age
1922  Ms Marianne Ennis  marianne.ennis@example.com   77

Listar en consola los 3 países con menor cantidad de usuarios.

In [44]:
data.groupby('country')['country'].count().sort_values().head(3)

country
Iran      70
Mexico    83
Serbia    86
Name: country, dtype: int64

Obtener el país con mayor cantidad de usuarios cuya edad sea mayor a 50.

In [47]:
data[data.age > 50].groupby('country')['country'].count().sort_values(ascending=False).head(1)

country
India    54
Name: country, dtype: int64

Obtener el país con mayor promedio de edad.

In [52]:
data.groupby('country')['age'].mean().sort_values(ascending=False).head(1)

country
India    52.540816
Name: age, dtype: float64

Mostrar en consola el país con más hombres.

In [58]:
data[data.gender == "male"].groupby("country")["gender"].count().sort_values(ascending=False).head(2)

country
Australia    60
Germany      60
Name: gender, dtype: int64

Mostrar en consola el nombre, username y edad de todos los usuarios cuya edad mayor a 10 y no sean del país México, Brasil y Canadá.

In [62]:
condition = (data.age > 10) & (~data.country.isin(["Mexico", "Brasil", "Canada"])) 

data[["name", "username", "age"]][condition]

                       name            username  age
0          Ms Fátima Martin      goldenmouse797   42
1         Mrs Molly Garrett       smallpanda982   30
2         Ms Veena Kulkarni       smalltiger174   53
3          Miss Sheryl Cole     beautifulcat191   74
4         Ms Nataša Subašić          bigbird256   55
...                     ...                 ...  ...
1995  Ms Viktoria Lauritsen       heavyzebra441   38
1996   Mr Christian Sørhaug      goldensnake897   28
1997       Ms Maria Peković         redzebra951   45
1998      Mrs Nicole Jensen     beautifuldog292   78
1999  Mr Percy Blankenstein  ticklishostrich632   36

[1812 rows x 3 columns]

Mostrar en consola el código postal de todos los usuarios de México.

In [63]:
data.postcode[data.country == "Mexico"]

9       43691
49      16073
52      52761
90      16543
91      78696
        ...
1813    96954
1822    61953
1836    35219
1912    56421
1964    58319
Name: postcode, Length: 83, dtype: object

Obtener la edad que más se repite en el DataFrame.

In [73]:
data.groupby("age")["age"].count().sort_values(ascending=False).head(1)

age
44    50
Name: age, dtype: int64

Obtener la edad que menos se repite en el DataFrame.

In [74]:
data.groupby("age")["age"].count().sort_values().head(1)

age
78    14
Name: age, dtype: int64